CSI API ETABS v1
cAreaObj.GetElm Method
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetElm(
	string Name,
	ref int NElm,
	ref string[] Elm
)
Function GetElm (
	Name As String,
	ByRef NElm As Integer,
	ByRef Elm As String()
) As Integer
Dim instance As cAreaObj
Dim Name As String
Dim NElm As Integer
Dim Elm As String()
Dim returnValue As Integer
returnValue = instance.GetElm(Name, NElm,
	Elm)
int GetElm(
	String^ Name,
	int% NElm,
	array<String^>^% Elm
)
abstract GetElm :
        Name : string *
        NElm : int byref *
        Elm : string[] byref -> int
Parameters
Name
Type: System.String
NElm
Type: System.Int32
Elm
Type: System.String[]
Return Value
Type: Int32
See Also
Reference
cAreaObj Interface
ETABSv1 Namespace